think/.local/bin/earlyoom-balanced
#!/usr/bin/env bash
# Early OOM - balanced policy and installer
# This script writes the earlyoom systemd drop-in with a conservative, balanced policy
# and restarts the service. It avoids /etc/default/ quoting issues by setting ExecStart directly.

# You can switch thresholds by exporting MODE=proactive before running.


# [[file:../../../root.org::*Early OOM - balanced policy and installer][Early OOM - balanced policy and installer:1]]
set -euo pipefail

MODE="${MODE:-balanced}"   # balanced or proactive

# Kill this stuff first if we MUST kill something:
#  - non-critical XFCE daemons
#  - media / background apps
#  - tools that autosave (Obsidian, Telegram)
PREFER='^(xfce4-screensaver|xfce4-clipman|xfdesktop|xfce4-notifyd|kdeconnectd|fluidsynth|jellyfin|[Oo]bsidian|Telegram|WebExtensions|qmmp)$'

# Protect these at all costs:
#  - browsers (no autosave guarantees)
#  - Codium / Code (no autosave guarantees in your current setup)
#  - file managers + GVFS plumbing
#  - file transfer / backup tools (rsync, etc.)
#  - xfce4-session so we don't drop the whole session
AVOID='^(firedragon|floorp|zen|ungoogled-chromium|firefox|codium|code|thunar|gvfs.*|rsync|scp|sftp|rclone|syncthing|borg|restic|xfce4-session|barrier|barriers|signal-desktop|Betterbird|betterbird|thunderbird)$'

if [[ "$MODE" = "balanced" ]]; then
  M_TERM=5;  M_KILL=3;  S_TERM=15; S_KILL=10
elif [[ "$MODE" = "proactive" ]]; then
  M_TERM=7;  M_KILL=5;  S_TERM=20; S_KILL=10
else
  echo "Unknown MODE='$MODE' (use balanced or proactive)" >&2
  exit 1
fi

DROPIN_DIR="/etc/systemd/system/earlyoom.service.d"
DROPIN="${DROPIN_DIR}/override.conf"

sudo install -d -m 0755 "$DROPIN_DIR"

# Write drop-in atomically
TMP="$(mktemp)"
cat >"$TMP" <<EOF
[Service]
EnvironmentFile=
ExecStart=
ExecStart=/usr/bin/earlyoom -r 3600 -m ${M_TERM},${M_KILL} -s ${S_TERM},${S_KILL} \
  --prefer ${PREFER} \
  --avoid  ${AVOID}
OOMScoreAdjust=-100
Nice=-20
EOF
sudo install -m 0644 "$TMP" "$DROPIN"
rm -f "$TMP"

sudo systemctl daemon-reload
sudo systemctl restart earlyoom

echo "Applied Early OOM policy: mem ${M_TERM}%/${M_KILL}%, swap ${S_TERM}%/${S_KILL}%"
echo "Prefer: ${PREFER}"
echo "Avoid:  ${AVOID}"

# Show the running command and thresholds
if pidof earlyoom >/dev/null; then
  tr '\0' ' ' </proc/$(pidof earlyoom)/cmdline; echo
  journalctl -u earlyoom -b --no-pager | tail -n 20
else
  echo "earlyoom is not running" >&2
  exit 2
fi
# Early OOM - balanced policy and installer:1 ends here
